# Pandas
Pandas is an important scientific package for structuring the data.<br>
Specifically, labeling the rows and columns is a useful feature in the Pandas package.<br>
Install:
```bash
pip install pandas
```
Data structures:
1. Series: 1D column
2. DataFrame: 2D (data sheet)

In [365]:
import pandas as pd

## Series

### Define

The most common methods to define a series:
1. Using standard Series constructor
2. Using dictionary

In [366]:
# Using standard Series constructor 
mySeries = pd.Series([1, 2, 3, 4, 5])
mySeries

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [367]:
# 1st arg = values, 2nd arg = labels
mySeries = pd.Series([1, 2, 3, 4, 5], index=['row1', 'row2', 'row3', 'row4', 'row5'])
mySeries

row1    1
row2    2
row3    3
row4    4
row5    5
dtype: int64

In [368]:
# Using dictionary
dic1 = {'row1': 1, 'row2': 2, 'row3': 3, 'row4': 4, 'row5': 5}
pd.Series(dic1)

row1    1
row2    2
row3    3
row4    4
row5    5
dtype: int64

We might use some items of a dictionary, instead of the whole. <br>
We might have also missing values.<br>
See the following example

In [369]:
dic2 = {'row1': 1, 'row2': 2, 'row4': 4}
pd.Series(dic2, index = ['row1', 'row2', 'row3'])

row1    1.0
row2    2.0
row3    NaN
dtype: float64

Why the type is float? Because of NaN (Not a Number) missing value.

In [370]:
# Redundant indices are allowed (in contrast to relational DBMSs)
redSeries = pd.Series([1, 2, 3, 4], index = ['row1', 'row2', 'row2', 'row3'])
redSeries

row1    1
row2    2
row2    3
row3    4
dtype: int64

In [371]:
# Copy
s = mySeries.copy()
s

row1    1
row2    2
row3    3
row4    4
row5    5
dtype: int64

### Reindexing

Note: reindex funcction does not only change the indices. It moves the whole rows.

For example, in the following example, row_0 is added and has no value, row1 to row4 are moved from the previous Series.

In [372]:
mySeries = mySeries.reindex(['row_0', 'row1', 'row2', 'row3', 'row4'])
mySeries

row_0    NaN
row1     1.0
row2     2.0
row3     3.0
row4     4.0
dtype: float64

In [373]:
# You can also use the renaming method for reindexing
s = pd.Series([10, 20, 30], index = ['r1', 'r2', 'r3'])
print("Before:\n", s)
s = s.rename({'r1':'a', 'r2':'b', 'r6':'c', 'r7':'h'}) # r6 and r7 do not exist, but no problem. It works omitting that labels
print("After:\n", s)

Before:
 r1    10
r2    20
r3    30
dtype: int64
After:
 a     10
b     20
r3    30
dtype: int64

In [374]:
# Assign names for the indices and the series itself
mySeries.index.name = "ROW"
mySeries.name = "My First Series"
mySeries

ROW
row_0    NaN
row1     1.0
row2     2.0
row3     3.0
row4     4.0
Name: My First Series, dtype: float64

### Access to the Elements

In [375]:
# The most common methods to access to the elemnts
print(mySeries)
print("The element at index 0 =", mySeries.iloc[0])
print("The 'row1' element = ", mySeries['row1'])

ROW
row_0    NaN
row1     1.0
row2     2.0
row3     3.0
row4     4.0
Name: My First Series, dtype: float64
The element at index 0 = nan
The 'row1' element =  1.0

In [376]:
# We can also assign new values to the elements
mySeries['row_0'] = 0
mySeries

ROW
row_0    0.0
row1     1.0
row2     2.0
row3     3.0
row4     4.0
Name: My First Series, dtype: float64

In [377]:
# Reading all values
mySeries.values

array([0., 1., 2., 3., 4.])

In [378]:
type(mySeries.values)

numpy.ndarray

In [379]:
# Reading all labels
mySeries.index

Index(['row_0', 'row1', 'row2', 'row3', 'row4'], dtype='object', name='ROW')

In [380]:
# More options to access to the values using its index label (in addition to mySeries['row3'])
print("mySeries value of row3:", mySeries.row3)
print("mySeries value of row3:", mySeries.loc['row3'])

mySeries value of row3: 3.0
mySeries value of row3: 3.0

In [381]:
# Note: If redundant indices exist, all the related values are returened 
print(redSeries)
print(f"\nTwo rows with the same index 'row2':\n{redSeries['row2']}")

row1    1
row2    2
row2    3
row3    4
dtype: int64

Two rows with the same index 'row2':
row2    2
row2    3
dtype: int64

In [382]:
redSeries['row2'] = 10
redSeries

row1     1
row2    10
row2    10
row3     4
dtype: int64

In [383]:
# Access to the value using its index position solve the problem of redundant indices
print("mySeries value of position 2:", mySeries.iloc[2]) 
redSeries.iloc[1] = 2
redSeries.iloc[2] = 3
print(f"\n'row2' is a redundant index, but iloc[1] and iloc[2] differs:\niloc[1] = {redSeries.iloc[1]}\niloc[2] = {redSeries.iloc[2]}")
mySeries

mySeries value of position 2: 2.0

'row2' is a redundant index, but iloc[1] and iloc[2] differs:
iloc[1] = 2
iloc[2] = 3

ROW
row_0    0.0
row1     1.0
row2     2.0
row3     3.0
row4     4.0
Name: My First Series, dtype: float64

In [384]:
# Head & Tail
print(mySeries.head(2)) # default number = 5
print(mySeries.tail(2))

ROW
row_0    0.0
row1     1.0
Name: My First Series, dtype: float64
ROW
row3    3.0
row4    4.0
Name: My First Series, dtype: float64

In [385]:
# Access to a subset similar to the list
print(mySeries)
mySeries[1:3]

ROW
row_0    0.0
row1     1.0
row2     2.0
row3     3.0
row4     4.0
Name: My First Series, dtype: float64

ROW
row1    1.0
row2    2.0
Name: My First Series, dtype: float64

In [386]:
mySeries[:3]

ROW
row_0    0.0
row1     1.0
row2     2.0
Name: My First Series, dtype: float64

In [387]:
# remove an element
mySeries = mySeries.drop(index = 'row4')
mySeries

ROW
row_0    0.0
row1     1.0
row2     2.0
row3     3.0
Name: My First Series, dtype: float64

In [388]:
# pop an element
p = mySeries.pop('row2') 
print(f"{p} is poped.")
print("New series:\n", mySeries)

2.0 is poped.
New series:
 ROW
row_0    0.0
row1     1.0
row3     3.0
Name: My First Series, dtype: float64

### Filtering

In [389]:
import math
ser = pd.Series([100, 200, math.nan, 400], index = ['A', 'B', 'C', 'D'])
ser

A    100.0
B    200.0
C      NaN
D    400.0
dtype: float64

In [390]:
ser.isna()

A    False
B    False
C     True
D    False
dtype: bool

In [391]:
ser.notna()

A     True
B     True
C    False
D     True
dtype: bool

In [392]:
ser.isin([5]);

In [393]:
ser.isin([100, 400])

A     True
B    False
C    False
D     True
dtype: bool

In [394]:
# Filtering by masks
cond = (ser>100)
print(cond)
ser[cond]

A    False
B     True
C    False
D     True
dtype: bool

B    200.0
D    400.0
dtype: float64

### Sorting

In [395]:
# sort
s.sort_values()

a     10
b     20
r3    30
dtype: int64

In [396]:
s.sort_index(ascending=False)

r3    30
b     20
a     10
dtype: int64

### Statistical Functions

In [397]:
# Statistical features 
s.describe()

count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

In [398]:
s.count()

3

In [399]:
s.quantile(0.25)

15.0

In [400]:
s.quantile([0.25, 0.75])

0.25    15.0
0.75    25.0
dtype: float64

### Math Operations

In [401]:
x = pd.Series([10, 20, 33])
y = pd.Series([1, 2, 3])
x + y # or x.add(y)

0    11
1    22
2    36
dtype: int64

In [402]:
x - y # or x.subtract(y)

0     9
1    18
2    30
dtype: int64

In [403]:
x * y # or x.multiply(y)

0    10
1    40
2    99
dtype: int64

In [404]:
x ** y # or x.pow(y)

0       10
1      400
2    35937
dtype: int64

In [405]:
x / y # or x.divide(y)

0    10.0
1    10.0
2    11.0
dtype: float64

In [406]:
x % y # or x.mod(y)

0    0
1    0
2    0
dtype: int64

In [407]:
x = pd.Series([10, 20, 33], index = ['r1', 'r2', 'r3'])
y = pd.Series([1, 2, 3], index = ['r1', 'r2', 'q3'])
x + y

q3     NaN
r1    11.0
r2    22.0
r3     NaN
dtype: float64

In [408]:
x.add(y, fill_value=0)

q3     3.0
r1    11.0
r2    22.0
r3    33.0
dtype: float64

In [409]:
x

r1    10
r2    20
r3    33
dtype: int64

In [410]:
y

r1    1
r2    2
q3    3
dtype: int64

### Merging

In [411]:
pd.concat([x, y])

r1    10
r2    20
r3    33
r1     1
r2     2
q3     3
dtype: int64

In [412]:
# Add a single element
pd.concat([pd.Series([0], index=['r0']), x])

r0     0
r1    10
r2    20
r3    33
dtype: int64

In [413]:
pd.concat([x, pd.Series([44], index=['r4'])])

r1    10
r2    20
r3    33
r4    44
dtype: int64

## DataFrame
DataFrame is indexed both by row and column.

### Define
The most common methods to define a data frame:
1. column by column
2. row by row
3. Read from file

In [414]:
# column by column using dictionary: 
# 1st arg = data, 2nd arg = row labels
myDictionary = {'col1':[1, 2, 3, 4], 'col2':[5, 6, 7, 8], 'col3':[9, 10, 11, 12], 'col4':[13, 14, 15, 16]}
myDataFrame = pd.DataFrame(myDictionary, 
                           index=['row1', 'row2', 'row3', 'row4'])
myDataFrame

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [415]:
# Row-by-row using a list of dictionaries
myStudent1 = {'Name': 'Ali', 'Score': 90, 'phone': '09121234567'}
myStudent2 = {'Name': 'Fatemeh', 'Score': 92}
pd.DataFrame([myStudent1, myStudent2], index=['std-1', 'std-2'])

          Name  Score        phone
std-1      Ali     90  09121234567
std-2  Fatemeh     92          NaN

In [416]:
# Row by row using ndarray: 
# 1st arg = data, 2nd arg = row labels, 3rd arg = colum labels
import numpy as np
myArray = np.array([[1, 5, 9, 13], [2, 6, 10, 14], [3, 7, 11, 15], [4, 8, 12, 16]])
myDataFrame = pd.DataFrame(myArray, 
                           index=['row1', 'row2', 'row3', 'row4'], 
                           columns = ['col1', 'col2', 'col3', 'col4'])
myDataFrame

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

Read values from other file formats<br>
```python
data = pd.read_csv("path//to//the//file")
data = pd.read_excel("path//to//the//file")
```
and lots of other formats...<br>
Loading data from comma seperated values (.csv) file into a dataFrame is one of the most common ways to manipulate data in data science and machine learning.<br>
In a .csv file, there is a list of column identifiers as strings on the first line of the file. Then, rows of data are presented.

In [417]:
df = pd.read_csv('datasets/smartphones.csv')
df
# read_csv() add a zero-started column as index to the dataFrame.
# If you want to use an existing column as index, pass the column number to the function as an argument.
# For example, df = pd.read_csv('smartphones.csv', index_col=0)

        Name       OS  Capacity  Ram  Weight    Company  inch
0  Galaxy S8  Android        64    4   149.0    Samsung   5.8
1  Lumia 950  windows        32    3   150.0  Microsoft   5.2
2  Xpreia L1  Android        16    2   180.0       Sony   5.5
3  iphone 7       ios       128    2   138.0      Apple   4.7
4    U Ultra  Android        64    4   170.0        HTC   5.7
5  Galaxy S5  Android        64    2   145.0    Samsung   5.1
6  iphone 5s      ios        32    1   112.0      Apple   4.0
7    Moto G5  Android        16    3   144.5   Motorola   5.0
8     Pixel   Android       128    4   143.0     Google   5.0

In [418]:
# Set specific column or columns as the index
df =df.set_index(['Name', 'Company'])
df

                          OS  Capacity  Ram  Weight  inch
Name      Company
Galaxy S8 Samsung    Android        64    4   149.0   5.8
Lumia 950 Microsoft  windows        32    3   150.0   5.2
Xpreia L1 Sony       Android        16    2   180.0   5.5
iphone 7  Apple          ios       128    2   138.0   4.7
U Ultra   HTC        Android        64    4   170.0   5.7
Galaxy S5 Samsung    Android        64    2   145.0   5.1
iphone 5s Apple          ios        32    1   112.0   4.0
Moto G5   Motorola   Android        16    3   144.5   5.0
Pixel     Google     Android       128    4   143.0   5.0

Reading CSV files is not always as straightforward as the above example. Sometimes the dataset itself has indices. It is also common that the first multiple lines describe the data or the organization or state the copyright. So, we should ensure that the DataFrame is initialized appropriately. See the following example:

In [419]:
# Reading sample dataset
populationDataFrame = pd.read_csv('datasets/sample_population.csv')
populationDataFrame.head()

,0,Data,NaN,2016,NaN.1,NaN.2
0,1,CountryName,CountryCode,Population growth,Total population,Area (sq. km)
1,2,Brazil,BRA,0.817555711,207652865,8358140
2,3,Switzerland,CHE,1.077221168,8372098,39516
3,4,Germany,DEU,1.193866758,82667685,348900
4,5,Denmark,DNK,0.834637611,0,42262

In [420]:
# Use the 2nd row (row number 1) as header and the 1st column (column 0) as index.
populationDataFrame = pd.read_csv('datasets/sample_population.csv',  header=1, index_col=0)
populationDataFrame

    CountryName CountryCode Population growth  Total population Area (sq. km)
1
2        Brazil         BRA       0.817555711         207652865       8358140
3   Switzerland         CHE       1.077221168           8372098         39516
4       Germany         DEU       1.193866758          82667685        348900
5       Denmark         DNK       0.834637611                 0         42262
6         Spain         ESP      -0.008048086          46443959        500210
7        France         FRA       0.407491036          66896109        547557
8         Japan         JPN      -0.115284177         126994511        364560
9        Greece         GRC      -0.687542545          10746740        128900
10         Iran         IRN         1.1487886          80277428       1628760
11       Kuwait         KWT       2.924206194           4052584             ?
12      Morocco         MAR                 ?          35276786        446300
13      Nigeria         NGA       2.619033526         185989640        910770
14        Qatar         QAT       3.495069918           2569804         11610
15       Sweden         SWE                 ?           9903122        407310
16        India         IND       1.148214693        1324171354       2973190
17        World         WLD        1.18167997        7442135578   129733172.7

In [421]:
# Fix the index problem: Reset to start from 0, then increment to start from 1
populationDataFrame.reset_index(drop= True, inplace=True) # drop means resets the index to the default integer index and drop the previous index.
populationDataFrame.index +=1
populationDataFrame

    CountryName CountryCode Population growth  Total population Area (sq. km)
1        Brazil         BRA       0.817555711         207652865       8358140
2   Switzerland         CHE       1.077221168           8372098         39516
3       Germany         DEU       1.193866758          82667685        348900
4       Denmark         DNK       0.834637611                 0         42262
5         Spain         ESP      -0.008048086          46443959        500210
6        France         FRA       0.407491036          66896109        547557
7         Japan         JPN      -0.115284177         126994511        364560
8        Greece         GRC      -0.687542545          10746740        128900
9          Iran         IRN         1.1487886          80277428       1628760
10       Kuwait         KWT       2.924206194           4052584             ?
11      Morocco         MAR                 ?          35276786        446300
12      Nigeria         NGA       2.619033526         185989640        910770
13        Qatar         QAT       3.495069918           2569804         11610
14       Sweden         SWE                 ?           9903122        407310
15        India         IND       1.148214693        1324171354       2973190
16        World         WLD        1.18167997        7442135578   129733172.7

In [426]:
# Copy
myNewDF = myDataFrame.copy()
myNewDF

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [427]:
# Reset row labels
myNewDF.reset_index() # NOT inplace

  index  col1  col2  col3  col4
0  row1     1     5     9    13
1  row2     2     6    10    14
2  row3     3     7    11    15
3  row4     4     8    12    16

In [428]:
myNewDF

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [429]:
myNewDF.reindex(['r1', 'row2', 3, 'row4'])

      col1  col2  col3  col4
r1     NaN   NaN   NaN   NaN
row2   2.0   6.0  10.0  14.0
3      NaN   NaN   NaN   NaN
row4   4.0   8.0  12.0  16.0

In [430]:
# Renaming the labels (column names)
myNewDF.rename(columns = {'col4':'last_col'}, inplace=True)
myNewDF

      col1  col2  col3  last_col
row1     1     5     9        13
row2     2     6    10        14
row3     3     7    11        15
row4     4     8    12        16

In [431]:
# Transpose
myNewDF.T

          row1  row2  row3  row4
col1         1     2     3     4
col2         5     6     7     8
col3         9    10    11    12
last_col    13    14    15    16

### Access to the Elements

In [432]:
# Show values
df.values

array([['Android', 64, 4, 149.0, 5.8],
       ['windows', 32, 3, 150.0, 5.2],
       ['Android', 16, 2, 180.0, 5.5],
       ['ios', 128, 2, 138.0, 4.7],
       ['Android', 64, 4, 170.0, 5.7],
       ['Android', 64, 2, 145.0, 5.1],
       ['ios', 32, 1, 112.0, 4.0],
       ['Android', 16, 3, 144.5, 5.0],
       ['Android', 128, 4, 143.0, 5.0]], dtype=object)

In [433]:
myDataFrame.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='object')

In [434]:
myDataFrame

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [435]:
# Access via label
myDataFrame.loc['row1', 'col2']

5

In [436]:
# Access via index
myDataFrame.iloc[0,1]

5

In [437]:
# Access to a row by its label
myDataFrame.loc['row1']

col1     1
col2     5
col3     9
col4    13
Name: row1, dtype: int32

In [438]:
# Access to a row by its index
myDataFrame.iloc[0]

col1     1
col2     5
col3     9
col4    13
Name: row1, dtype: int32

In [439]:
myDataFrame.iloc[[0, 1]]

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14

In [440]:
# Access to a column by its label
myDataFrame['col1']

row1    1
row2    2
row3    3
row4    4
Name: col1, dtype: int32

In [441]:
# Access to a column by its index
myDataFrame.iloc[:, 0]

row1    1
row2    2
row3    3
row4    4
Name: col1, dtype: int32

In [442]:
# Access to a column by its label- More structured method
myDataFrame.loc[:, 'col1']

row1    1
row2    2
row3    3
row4    4
Name: col1, dtype: int32

In [443]:
# The second approach is prefered because you have more opptions for slicing.
myDataFrame.loc['row2':'row3', 'col1':'col3']

      col1  col2  col3
row2     2     6    10
row3     3     7    11

In [444]:
myDataFrame.loc['row1':'row3', ['col1','col3']]

      col1  col3
row1     1     9
row2     2    10
row3     3    11

In [445]:
myDataFrame.loc[['row1','row3'], ['col1','col3']]

      col1  col3
row1     1     9
row3     3    11

In [446]:
myDataFrame.iloc[[0,2], [0,2]]

      col1  col3
row1     1     9
row3     3    11

In [447]:
myDataFrame.iloc[0:2, 0:2]

      col1  col2
row1     1     5
row2     2     6

In [448]:
myDataFrame

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [449]:
myDataFrame.iloc[:, [False, True, False, True]]

      col2  col4
row1     5    13
row2     6    14
row3     7    15
row4     8    16

In [450]:
myDataFrame.iloc[[True, False, False, True], [False, True, False, True]]

      col2  col4
row1     5    13
row4     8    16

In [451]:
# Head & Tail
print("myDataFrame first 2 rows")
print(myDataFrame.head(2)) # default number = 5
print("myDataFrame last 2 rows")
print(myDataFrame.tail(2))

myDataFrame first 2 rows
      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
myDataFrame last 2 rows
      col1  col2  col3  col4
row3     3     7    11    15
row4     4     8    12    16

In [452]:
# Reading column and row labels
print("myDataFrame indices: ", myDataFrame.index)
print("myDataFrame columns: ", myDataFrame.columns)
# This attribute is useful when we read data from .csv file. 
# Sometimes, the column names have spaces or tabs.
# We cannot see these spaces when we use head() function.

myDataFrame indices:  Index(['row1', 'row2', 'row3', 'row4'], dtype='object')
myDataFrame columns:  Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [455]:
# Useful Example
cols = list(populationDataFrame.columns)
cols = [x.title().strip() for x in cols]
populationDataFrame.columns = cols
populationDataFrame.head()

   Countryname Countrycode Population Growth  Total Population Area (Sq. Km)
1       Brazil         BRA       0.817555711         207652865       8358140
2  Switzerland         CHE       1.077221168           8372098         39516
3      Germany         DEU       1.193866758          82667685        348900
4      Denmark         DNK       0.834637611                 0         42262
5        Spain         ESP      -0.008048086          46443959        500210

In [456]:
myDataFrame

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [457]:
# Broadcasting also works in this context
import math
myDataFrame['col4']= math.nan
myDataFrame

      col1  col2  col3  col4
row1     1     5     9   NaN
row2     2     6    10   NaN
row3     3     7    11   NaN
row4     4     8    12   NaN

In [458]:
# Modify values
myDataFrame.loc[['row1', 'row3'], 'col1'] = 0
myDataFrame

      col1  col2  col3  col4
row1     0     5     9   NaN
row2     2     6    10   NaN
row3     0     7    11   NaN
row4     4     8    12   NaN

In [459]:
# Delete a row
myDataFrame.drop('row2')
# Note: To delete a row using index number, you should use this syntax: drop(index = N)

      col1  col2  col3  col4
row1     0     5     9   NaN
row3     0     7    11   NaN
row4     4     8    12   NaN

drop function returns a copy and do NOT change the original dataFrame.

In [460]:
myDataFrame

      col1  col2  col3  col4
row1     0     5     9   NaN
row2     2     6    10   NaN
row3     0     7    11   NaN
row4     4     8    12   NaN

If you want to edit the original dataFrame, pass the inplace=True argument to the function.

In [461]:
# Delete a column
myDataFrame.drop(['col3', 'col4'], axis=1, inplace=True) # axis: where to find the label? 0 for rows and 1 for columns
myDataFrame

      col1  col2
row1     0     5
row2     2     6
row3     0     7
row4     4     8

In [462]:
# It is also possible to use the Python del keyword to delete a row or column
del myDataFrame['col2']
myDataFrame

      col1
row1     0
row2     2
row3     0
row4     4

In [463]:
# Access to the elements when multiple indices are in use
df.loc['Galaxy S8', 'Samsung']

Os          Android
Capacity         64
Ram               4
Weight        149.0
Inch            5.8
Name: (Galaxy S8, Samsung), dtype: object

### Sorting

In [464]:
myArray = np.array([[1, 5, 9, 13], [2, 6, 10, 14], [3, 7, 11, 15], [4, 8, 12, 16]])
myDataFrame = pd.DataFrame(myArray, 
                           index=['row1', 'row2', 'row3', 'row4'], 
                           columns = ['col1', 'col2', 'col3', 'col4'])
myDataFrame

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [465]:
# Sorting based on labels (Columns)
myDataFrame.sort_index(axis=1, ascending=False, inplace=True)
myDataFrame

      col4  col3  col2  col1
row1    13     9     5     1
row2    14    10     6     2
row3    15    11     7     3
row4    16    12     8     4

In [466]:
# Sorting based on indices
myDataFrame.sort_index(axis=0, ascending=False, inplace=True)
myDataFrame

      col4  col3  col2  col1
row4    16    12     8     4
row3    15    11     7     3
row2    14    10     6     2
row1    13     9     5     1

In [467]:
# Note: When we sort the Dataframe, numeric indices will be changed. 
myDataFrame.iloc[[0, 2], 0] = 0
myDataFrame

      col4  col3  col2  col1
row4     0    12     8     4
row3    15    11     7     3
row2     0    10     6     2
row1    13     9     5     1

In [468]:
# Sorting based on values
myDataFrame.sort_values(by='col4')

      col4  col3  col2  col1
row4     0    12     8     4
row2     0    10     6     2
row1    13     9     5     1
row3    15    11     7     3

In [469]:
# Sorting based on values; More than one column
myDataFrame.sort_values(by=['col4', 'col3'])

      col4  col3  col2  col1
row2     0    10     6     2
row4     0    12     8     4
row1    13     9     5     1
row3    15    11     7     3

### Statistical Functions

In [470]:
# idxmin, idxmax
myDataFrame.idxmax()

col4    row3
col3    row4
col2    row4
col1    row4
dtype: object

In [471]:
myDataFrame.describe()

            col4       col3      col2      col1
count   4.000000   4.000000  4.000000  4.000000
mean    7.000000  10.500000  6.500000  2.500000
std     8.124038   1.290994  1.290994  1.290994
min     0.000000   9.000000  5.000000  1.000000
25%     0.000000   9.750000  5.750000  1.750000
50%     6.500000  10.500000  6.500000  2.500000
75%    13.500000  11.250000  7.250000  3.250000
max    15.000000  12.000000  8.000000  4.000000

In [472]:
myDataFrame.sum()

col4    28
col3    42
col2    26
col1    10
dtype: int64

In [473]:
myDataFrame.sum(axis=1)

row4    24
row3    36
row2    18
row1    28
dtype: int64

In [474]:
myDataFrame.mean()

col4     7.0
col3    10.5
col2     6.5
col1     2.5
dtype: float64

### Apply Custom Functions

In [475]:
# Apply a custom function to the whole dataframe
def func(x):
    return pd.Series([x.min(), x.max(), x.mean()], index = ['min', 'max', 'Mean'])
myDataFrame.apply(func)

      col4  col3  col2  col1
min    0.0   9.0   5.0   1.0
max   15.0  12.0   8.0   4.0
Mean   7.0  10.5   6.5   2.5

In [476]:
# Apply a custom function to an specific column
func = lambda x: x-1
myDataFrame['col4'].map(func)

row4    -1
row3    14
row2    -1
row1    12
Name: col4, dtype: int64

In [477]:
# Apply a custom function to the dataframe elemnts
func = lambda x: '{:.2f}'.format(x)
myDataFrame.applymap(func)

C:\Users\Pc\AppData\Local\Temp\ipykernel_11948\1847349442.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  myDataFrame.applymap(func)

       col4   col3  col2  col1
row4   0.00  12.00  8.00  4.00
row3  15.00  11.00  7.00  3.00
row2   0.00  10.00  6.00  2.00
row1  13.00   9.00  5.00  1.00

### Math Operations

In [478]:
# Mathematical operations are also available 
# +, -, *,...
d1 = pd.DataFrame(data= np.arange(12).reshape(4, 3), columns= ['C1', 'C2', 'C3'])
d1

   C1  C2  C3
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11

In [479]:
d2 = pd.DataFrame(data= np.arange(6).reshape(3, 2), columns= ['C1', 'C2'])
d2

   C1  C2
0   0   1
1   2   3
2   4   5

In [480]:
d1 + d2

     C1    C2  C3
0   0.0   2.0 NaN
1   5.0   7.0 NaN
2  10.0  12.0 NaN
3   NaN   NaN NaN

In [481]:
d1.add(d2, fill_value=0)

     C1    C2    C3
0   0.0   2.0   2.0
1   5.0   7.0   5.0
2  10.0  12.0   8.0
3   9.0  10.0  11.0

### Handling Missing Values
Although most missing values are often formatted as NaN (Not a Number), NaT (Not a Time), None, NULL, or N/A, sometimes they are labeled with a non-standard string, such as ?, or even more worse, they are not labeled so clearly. For example, a reasercher may use 99 (an out of range value) to indicate a missing value.<br>
To get rid of the missing values, we should first replace all untyped or out-of-range missing values with math.nan. Then, use one of the following functions:
- dropna() drops the rows (default) or columns(axis=1) containing NaNs.<br>
- fillna() fills the missing value with another value.

In [482]:
populationDataFrame

    Countryname Countrycode Population Growth  Total Population Area (Sq. Km)
1        Brazil         BRA       0.817555711         207652865       8358140
2   Switzerland         CHE       1.077221168           8372098         39516
3       Germany         DEU       1.193866758          82667685        348900
4       Denmark         DNK       0.834637611                 0         42262
5         Spain         ESP      -0.008048086          46443959        500210
6        France         FRA       0.407491036          66896109        547557
7         Japan         JPN      -0.115284177         126994511        364560
8        Greece         GRC      -0.687542545          10746740        128900
9          Iran         IRN         1.1487886          80277428       1628760
10       Kuwait         KWT       2.924206194           4052584             ?
11      Morocco         MAR                 ?          35276786        446300
12      Nigeria         NGA       2.619033526         185989640        910770
13        Qatar         QAT       3.495069918           2569804         11610
14       Sweden         SWE                 ?           9903122        407310
15        India         IND       1.148214693        1324171354       2973190
16        World         WLD        1.18167997        7442135578   129733172.7

In [483]:
# Replace a non-standard string '?' with NAN
populationDataFrame.replace('?', math.nan, inplace=True)
populationDataFrame

    Countryname Countrycode Population Growth  Total Population Area (Sq. Km)
1        Brazil         BRA       0.817555711         207652865       8358140
2   Switzerland         CHE       1.077221168           8372098         39516
3       Germany         DEU       1.193866758          82667685        348900
4       Denmark         DNK       0.834637611                 0         42262
5         Spain         ESP      -0.008048086          46443959        500210
6        France         FRA       0.407491036          66896109        547557
7         Japan         JPN      -0.115284177         126994511        364560
8        Greece         GRC      -0.687542545          10746740        128900
9          Iran         IRN         1.1487886          80277428       1628760
10       Kuwait         KWT       2.924206194           4052584           NaN
11      Morocco         MAR               NaN          35276786        446300
12      Nigeria         NGA       2.619033526         185989640        910770
13        Qatar         QAT       3.495069918           2569804         11610
14       Sweden         SWE               NaN           9903122        407310
15        India         IND       1.148214693        1324171354       2973190
16        World         WLD        1.18167997        7442135578   129733172.7

In [484]:
# Delete rows containing NAN
populationDataFrame.dropna() # Not inplace

    Countryname Countrycode Population Growth  Total Population Area (Sq. Km)
1        Brazil         BRA       0.817555711         207652865       8358140
2   Switzerland         CHE       1.077221168           8372098         39516
3       Germany         DEU       1.193866758          82667685        348900
4       Denmark         DNK       0.834637611                 0         42262
5         Spain         ESP      -0.008048086          46443959        500210
6        France         FRA       0.407491036          66896109        547557
7         Japan         JPN      -0.115284177         126994511        364560
8        Greece         GRC      -0.687542545          10746740        128900
9          Iran         IRN         1.1487886          80277428       1628760
12      Nigeria         NGA       2.619033526         185989640        910770
13        Qatar         QAT       3.495069918           2569804         11610
15        India         IND       1.148214693        1324171354       2973190
16        World         WLD        1.18167997        7442135578   129733172.7

In [485]:
# Replace NANs with 0
populationDataFrame.fillna(0)

    Countryname Countrycode Population Growth  Total Population Area (Sq. Km)
1        Brazil         BRA       0.817555711         207652865       8358140
2   Switzerland         CHE       1.077221168           8372098         39516
3       Germany         DEU       1.193866758          82667685        348900
4       Denmark         DNK       0.834637611                 0         42262
5         Spain         ESP      -0.008048086          46443959        500210
6        France         FRA       0.407491036          66896109        547557
7         Japan         JPN      -0.115284177         126994511        364560
8        Greece         GRC      -0.687542545          10746740        128900
9          Iran         IRN         1.1487886          80277428       1628760
10       Kuwait         KWT       2.924206194           4052584             0
11      Morocco         MAR                 0          35276786        446300
12      Nigeria         NGA       2.619033526         185989640        910770
13        Qatar         QAT       3.495069918           2569804         11610
14       Sweden         SWE                 0           9903122        407310
15        India         IND       1.148214693        1324171354       2973190
16        World         WLD        1.18167997        7442135578   129733172.7

### Merging

In [486]:
# Define two sample dataframes
df1 = pd.DataFrame([{'Name': 'Hossein', 'Role': 'Lecturer'}, 
                         {'Name': 'Zahra', 'Role': 'HR Director'},
                         {'Name': 'Ali', 'Role': 'Accountant'}])
df1.set_index('Name', inplace= True)
df2 = pd.DataFrame([{'Name': 'Ali', 'School': 'Buisiness'},
                           {'Name': 'Fatemeh', 'School': 'Law'},
                           {'Name': 'Zahra', 'School': 'Engineering'}])
df2.set_index('Name', inplace= True)

# Both dataframes are indexed along the value we want to merge them.

In [487]:
df1

                Role
Name
Hossein     Lecturer
Zahra    HR Director
Ali       Accountant

In [488]:
df2

              School
Name
Ali        Buisiness
Fatemeh          Law
Zahra    Engineering

In [489]:
# Inner join = intersection
df1.merge(df2, on='Name') #OR df1.merge(df2, on="Name", how='inner')

              Role       School
Name
Zahra  HR Director  Engineering
Ali     Accountant    Buisiness

In [490]:
# Outer join = Union
df1.merge(df2, on="Name", how='outer')

                Role       School
Name
Ali       Accountant    Buisiness
Fatemeh          NaN          Law
Hossein     Lecturer          NaN
Zahra    HR Director  Engineering

In [491]:
# Left join = intersection + left
df1.merge(df2, on="Name", how='left')

                Role       School
Name
Hossein     Lecturer          NaN
Zahra    HR Director  Engineering
Ali       Accountant    Buisiness

In [492]:
# Right join = intersection + right
df1.merge(df2, on="Name", how='right')

                Role       School
Name
Ali       Accountant    Buisiness
Fatemeh          NaN          Law
Zahra    HR Director  Engineering

In [493]:
df1.index.name = 'N1'
df1

                Role
N1
Hossein     Lecturer
Zahra    HR Director
Ali       Accountant

In [494]:
df2.index.name = 'N2'
df2

              School
N2
Ali        Buisiness
Fatemeh          Law
Zahra    Engineering

In [495]:
df1.merge(df2, left_on='N1', right_on='N2')

          Role       School
0  HR Director  Engineering
1   Accountant    Buisiness

In [496]:
# Add a new row to the existing DataFrame
df2 = pd.DataFrame([[40, 80, 120, 160, 200]], columns=['col1','col2','col3', 'col4', 'col5'], index=['row5'])
pd.concat([myDataFrame, df2])

      col4  col3  col2  col1   col5
row4     0    12     8     4    NaN
row3    15    11     7     3    NaN
row2     0    10     6     2    NaN
row1    13     9     5     1    NaN
row5   160   120    80    40  200.0

In [497]:
# Add a new column to the existing DataFrame
myDataFrame['col5']= [17, 18, 19, 20] # OR myDataFrame.loc[:, 'col5'] = [17, 18, 19, 20]
# Broadcasting also works
myDataFrame['col6'] = 1
myDataFrame

      col4  col3  col2  col1  col5  col6
row4     0    12     8     4    17     1
row3    15    11     7     3    18     1
row2     0    10     6     2    19     1
row1    13     9     5     1    20     1

### Aggregation over groups
The function DataFrameGroupBy.agg aggregates data using one or more operations over the specified axis.

In [498]:
data = {"A": [1, 1, 2, 2], "B": [1, 2, 3, 4], "C": [0.362838, 0.227877, 1.267767, -0.562860]}
df = pd.DataFrame(data)
df

   A  B         C
0  1  1  0.362838
1  1  2  0.227877
2  2  3  1.267767
3  2  4 -0.562860

In [499]:
# The same aggregation function over all columns. (Single aggregation)
# Example: for each group of data in A, find the minimum in other columns
df.groupby('A').agg('min')

   B         C
A
1  1  0.227877
2  3 -0.562860

List of available aggregation functions:
- min
- max
- sum
- mean
- median
- var
- std
- count

In [500]:
# The same aggregation function over all columns (Multiple aggregations)
# Example: for each group of data in A, find the minimum and maximum in other columns
df.groupby('A').agg(['min', 'max'])

    B             C
  min max       min       max
A
1   1   2  0.227877  0.362838
2   3   4 -0.562860  1.267767

In [501]:
# Select a column for aggregation
df.groupby('A').B.agg(['min', 'max'])

   min  max
A
1    1    2
2    3    4

In [502]:
df

   A  B         C
0  1  1  0.362838
1  1  2  0.227877
2  2  3  1.267767
3  2  4 -0.562860

In [503]:
# User-defined function for aggregation
df.groupby('A').agg(lambda x: sum(x) + 2)

   B         C
A
1  5  2.590715
2  9  2.704907

In [504]:
# Different aggregations per column
df.groupby('A').agg({'B': ['min', 'max'], 'C': 'sum'})

    B             C
  min max       sum
A
1   1   2  0.590715
2   3   4  0.704907

In [505]:
# Named Aggregation: Control the output names with different aggregations per column
df.groupby("A").agg(
    MIN=pd.NamedAgg(column="B", aggfunc="min"), 
    MAX=pd.NamedAgg(column="B", aggfunc="max"),
    SUM=pd.NamedAgg(column="C", aggfunc="sum"))

   MIN  MAX       SUM
A
1    1    2  0.590715
2    3    4  0.704907